snlkuharlocal/src/Documents/ЗаданиеНаСборкуКомплектовЧЗ/ЗаданиеНаСборкуКомплектовЧЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаданиеНаСборкуКомплектовЧЗ</name>
  <comment>Задание на сборку комплектов ЗЧ</comment>
  <basedOn>Document.ЗаданиеНабора</basedOn>
  <basedOn>Document.Комплектация</basedOn>
  <basedOn>Document.РасходнаяНакладная</basedOn>
  <registerRecords>InformationRegister.РезервыКМ</registerRecords>
  <registerRecords>InformationRegister.СтатусыКМ_Факт</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиДоступныхКМ</registerRecords>
  <registerRecords>InformationRegister.СтатусыКМ_Факт_А</registerRecords>
  <registerRecords>InformationRegister.ОшибкиПолученияКМ</registerRecords>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппыТоваров</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокОснование</name>
    <type>
      <types>DocumentRef.Комплектация</types>
      <types>DocumentRef.РасходнаяНакладная</types>
      <types>DocumentRef.Перемаркировка</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеНакладной</name>
    <type>
      <types>EnumRef.СостоянияНакладной</types>
    </type>
  </attributes>
  <attributes>
    <name>СформированыАгрегации</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаданиеНабора</name>
    <type>
      <types>DocumentRef.ЗаданиеНабора</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоШК</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоКомплектующих</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусОбработкиЧЗ</name>
    <type>
      <types>EnumRef.СтатусыДокументовМаркировки</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьМаркированыеКомплектующие</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусыАктуализированы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РабочееМесто</name>
    <type>
      <types>CatalogRef.РабочиеМеста</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Единица</name>
      <type>
        <types>CatalogRef.Единицы</types>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Комплектующие</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Единица</name>
      <type>
        <types>CatalogRef.Единицы</types>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Продукция</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ШтрихкодыУпаковок</name>
    <attributes>
      <name>ШтрихкодУпаковки</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
    <attributes>
      <name>ШтрихкодКоробки</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
    <attributes>
      <name>ЛистСборки</name>
      <type>
        <types>DocumentRef.ЛистСборкиКомплектовЧЗ</types>
      </type>
    </attributes>
    <attributes>
      <name>Распечатан</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Нанесен</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗабронированПодСборку</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/Enums/СостоянияНакладной/СостоянияНакладной.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияНакладной</name>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>КОтправкеНаСклад</name>
    <comment>Накладная готова к отправке на склад</comment>
  </enumValues>
  <enumValues>
    <name>ПолученоСкладом</name>
  </enumValues>
  <enumValues>
    <name>ВНаборе</name>
  </enumValues>
  <enumValues>
    <name>Сканирование</name>
  </enumValues>
  <enumValues>
    <name>ГотоваКОтгрузке</name>
  </enumValues>
  <enumValues>
    <name>Отгружена</name>
  </enumValues>
  <enumValues>
    <name>Принята</name>
    <comment>Накладная оприходована складом</comment>
  </enumValues>
  <enumValues>
    <name>ГотоваКПриемке</name>
  </enumValues>
  <enumValues>
    <name>КОтправкеВОфис</name>
  </enumValues>
  <enumValues>
    <name>ПолученоОфисом</name>
  </enumValues>
  <enumValues>
    <name>Доставлена</name>
  </enumValues>
  <enumValues>
    <name>ПринятаНаТранзитныйСклад</name>
    <comment>Накладная приянта на транзитный склад</comment>
  </enumValues>
  <enumValues>
    <name>ОтгруженаНаТранзитныйСклад</name>
    <comment>Накладная приянта на транзитный склад</comment>
  </enumValues>
  <enumValues>
    <name>РезервУпаковки</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеОплаты</name>
  </enumValues>
  <enumValues>
    <name>ДопОбработка</name>
  </enumValues>
  <enumValues>
    <name>ДоставленаНаСклад</name>
  </enumValues>
  <enumValues>
    <name>ВМашине</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеНабора</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеСканирования</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеДопОбработки</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеПереукладки</name>
  </enumValues>
  <enumValues>
    <name>Переукладка</name>
  </enumValues>
  <enumValues>
    <name>ВЗонеХранения</name>
  </enumValues>
  <enumValues>
    <name>ПроверенаПоОстаткам</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеПаллетирования</name>
  </enumValues>
  <enumValues>
    <name>Паллетирование</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеТермоусадки</name>
  </enumValues>
  <enumValues>
    <name>Термоусадка</name>
  </enumValues>
  <enumValues>
    <name>СформированыЗаданияНабора</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеКорректировки</name>
  </enumValues>
  <enumValues>
    <name>Отменена</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеКомплектацииЧЗ</name>
  </enumValues>
  <enumValues>
    <name>КомплектацияЧЗ</name>
  </enumValues>
  <enumValues>
    <name>ЗаказКМЧЗ</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеОбработкиЧЗ</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Documents/ЛистСборкиКомплектовЧЗ/ЛистСборкиКомплектовЧЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЛистСборкиКомплектовЧЗ</name>
  <comment>Лист сборки комплектов маркированого товара </comment>
  <basedOn>Document.ЗаданиеНаСборкуКомплектовЧЗ</basedOn>
  <registerRecords>InformationRegister.СтатусыКМ_Факт</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиДоступныхКМ</registerRecords>
  <registerRecords>InformationRegister.СтатусыКМ_Факт_А</registerRecords>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппыТоваров</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокОснование</name>
    <type>
      <types>DocumentRef.ЗаданиеНаСборкуКомплектовЧЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоКомплектующих</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Завершен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЛистНабора</name>
    <type>
      <types>DocumentRef.ЛистПереукладки</types>
      <types>DocumentRef.ЛистНабора</types>
    </type>
  </attributes>
  <attributes>
    <name>Продукция</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>фРежим</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УзелТСД</name>
    <type>
      <types>ExchangePlanRef.МобильныеТСД</types>
    </type>
  </attributes>
  <attributes>
    <name>СборщикКомплектаТСД</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусыАктуализированы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаСканирования</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияСканирования</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>РабочееМесто</name>
    <type>
      <types>CatalogRef.РабочиеМеста</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Единица</name>
      <type>
        <types>CatalogRef.Единицы</types>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ШтрихкодыУпаковок</name>
    <attributes>
      <name>КодКомплектаПодтвержденСканированием</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Комплектующее</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ШтрихкодКомплекта</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
    <attributes>
      <name>ШтрихкодУпаковки</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
    <attributes>
      <name>ШтрихкодКоробки</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаФормированияКомплекта</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>КодКомплектующегоНеНанесен</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Бригада</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/Documents/ЗаданиеНаСборкуКомплектовЧЗ/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	МаркировкаКС.УстановитьПараметрДинамическогоСписка(СписокЛСК, 		"ДокОснование", Объект.Ссылка);
	МаркировкаКС.УстановитьПараметрДинамическогоСписка(СписокАгрегаций, "ДокОснование", Объект.Ссылка);
	
	ОпределитьСкладМаркированногоТовара(); // Кельманов А.В. - HELP-4221 - 2025.07.17
	
	СоздаватьЛП_ПоЛСК = СоздаватьЛП_ПоЛСК(Объект.ДокОснование); // Кельманов А.В. - ИЗМ-0000000124 - 2026.07.01
	
	ОбновитьКоличествоСобраных_НаСервере();
	УправлениеВидимостью();
	
	фПечататьЛентуСразуНаПинтер = Истина;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	// Кельманов А.В. - HELP-5168 - 2025.06.03 {
	Если Параметры.Ключ.Пустая() И ЗначениеЗаполнено(Объект.ДокОснование) И ТипЗнч(Объект.ДокОснование) = Тип("ДокументСсылка.РасходнаяНакладная") Тогда
		
		ТребуетсяМаркировка = ПолучитьРеквизитШапки(Объект.ДокОснование, "ТребуетсяМаркировка");
		
		Если ТребуетсяМаркировка И Объект.ШтрихкодыУпаковок.Количество() = 0 Тогда
			
			Записать();
			
			Ошибки = ЗаполнитьКодыЧЗ();
			
			Если Ошибки <> "" Тогда
				
				Сообщить(Ошибки);
				
			КонецЕсли;
			
			Прочитать();
			
		КонецЕсли;
		
	КонецЕсли;
	// Кельманов А.В. - HELP-5168 - 2025.06.03 }
	
	Элементы.Продукция.ВыделенныеСтроки.Очистить();
	
КонецПроцедуры

// Кельманов А.В. - HELP-4221 - 2025.07.17
&НаСервере
Процедура ОпределитьСкладМаркированногоТовара()
	
	ЭтоСкладМаркированногоТовара = Ложь;
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЕСТЬNULL(ЗаданиеНаСборкуКомплектовЧЗ.ДокОснование.Склад.ЭтоСкладМаркированногоТовара, ЛОЖЬ) КАК ЭтоСкладМаркированногоТовара
	               |ИЗ
	               |	Документ.ЗаданиеНаСборкуКомплектовЧЗ КАК ЗаданиеНаСборкуКомплектовЧЗ
	               |ГДЕ
	               |	ЗаданиеНаСборкуКомплектовЧЗ.Ссылка = &ЗСБ";
	
	Запрос.УстановитьПараметр("ЗСБ", Объект.Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		ЭтоСкладМаркированногоТовара = Выборка.ЭтоСкладМаркированногоТовара;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УправлениеВидимостью()
	Если РольДоступна("Администратор") Тогда	
		Элементы.СостояниеНакладной.ТолькоПросмотр		= ТолькоПросмотр;	
		Элементы.ШтрихкодыУпаковок.ТолькоПросмотр		= ТолькоПросмотр;	
		Элементы.ШтрихкодыУпаковок.ИзменятьСоставСтрок	= Истина;
		
		Элементы.ШтрихкодыУпаковокРаспечатан.Доступность = Истина;
	КонецЕсли;
	
	Если Объект.СостояниеНакладной = Перечисления.СостоянияНакладной.Отгружена Тогда
		Если НЕ РольДоступна("Администратор") Тогда
			ТолькоПросмотр 								= Истина;
			Элементы.кнНапечататьКодыПоЛН.Доступность 	= Ложь;
		КонецЕсли;
	КонецЕсли;
	
	// Кельманов А.В. - для чистки зависших документов ЛСК при сборке спаек на ТСД - 2025.04.02 {
	Элементы.ФормаУдалитьИзЛСКСтрокиСПустымиКодамиКомплектующих.Видимость = ПолучитьПолномочиеПользователя(ПланыВидовХарактеристик.ПолномочияПользователей.УдалениеИзЛСКСтрокСПустымиКодамиКомплектующих);
	// Кельманов А.В. - для чистки зависших документов ЛСК при сборке спаек на ТСД - 2025.04.02 }
	
КонецПроцедуры

&НаКлиенте
Процедура ШтрихкодыУпаковок_Выбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если ВыбраннаяСтрока<>Неопределено И Поле <> Неопределено Тогда
		ТекЗначение = Объект.ШтрихкодыУпаковок.НайтиПоИдентификатору(ВыбраннаяСтрока)[Сред(Поле.Имя, СтрДлина(Элемент.Имя)+1)]; 
		ПоказатьЗначение(, ТекЗначение);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ШтрихкодыУпаковок_ПриАктивизацииСтроки(Элемент)
	Если Элемент.ТекущиеДанные <> Неопределено Тогда	
		ТекущаяНоменклатура = ПолучитьРеквизитШапки(Элемент.ТекущиеДанные.ШтрихкодУпаковки, "Владелец");
	КонецЕсли; 	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ШтрихкодыУпаковокПриАктивизацииСтроки_НаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьМаркировку(Команда)
	Если Модифицированность ИЛИ НЕ Объект.Проведен Тогда
		Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение));	
	КонецЕсли;
	
	рПроверки = ВсеЛистыСборкиЗавершены();
	Если рПроверки.Успешно Тогда
		рЗавершения = ЗавершитьМаркировку_НаСервере();
		Если рЗавершения.Успешно Тогда	
			Сообщить("Маркировка завершена.", СтатусСообщения.Информация);
			Сообщить("Сформировано: "+ рЗавершения.ОбработаноОбъектов+" агрегаций.", СтатусСообщения.Информация);
			
			Закрыть();
		Иначе		
			Сообщить(СтрСоединить(рЗавершения.Ошибки, Символы.ПС), СтатусСообщения.Важное);	
		КонецЕсли;
	Иначе
		Сообщить("Обнаружены ошибки ЛМО !", СтатусСообщения.Важное);
		Сообщить(СтрСоединить(рПроверки.Ошибки, Символы.ПС));
	КонецЕсли; 	
	 
КонецПроцедуры

&НаСервере
Функция ВсеЛистыСборкиЗавершены()
	Результат = МаркировкаКС.СтруктураРезультата();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	Ссылка,Проведен,Завершен
	|ИЗ
	|	Документ.ЛистСборкиКомплектовЧЗ
	|ГДЕ
	|	ДокОснование = &ДокОснование	
	|	И НЕ (Завершен И Проведен)
	|";
	
	Запрос.УстановитьПараметр("ДокОснование", Объект.Ссылка);	
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если НЕ Выборка.Проведен Тогда		
			Результат.Ошибки.Добавить("ЛМО не проведен: " + Выборка.Ссылка + " !");
		КонецЕсли; 					
		Если НЕ Выборка.Завершен Тогда		                                 
			Результат.Ошибки.Добавить("ЛМО не завершен: " + Выборка.Ссылка + " !");
		КонецЕсли;
	КонецЦикла;
	
	Результат.Успешно = (Результат.Ошибки.Количество() = 0);
	
	Возврат Результат;
КонецФункции //ВсеЛистыСборкиЗавершены()
	
&НаСервере
Функция ЗавершитьМаркировку_НаСервере()
	Результат = МаркировкаКС.СтруктураРезультата();
	
	рАгрегации = Документы.ЗаданиеНаМаркировку.Создать_Агрегации(Объект.Ссылка);
	Если рАгрегации.Успешно Тогда
		Результат.ОбработаноОбъектов = рАгрегации.ОбработаноОбъектов;
		
		Объект.СостояниеНакладной 		= Перечисления.СостоянияНакладной.Отгружена;
		Объект.СформированыАгрегации    = Истина;
		Записать();
		
		рХКМ = Документы.ХранилищеКодовМаркировки.Создать_ХКМ_к_ЗМО(Объект.Ссылка);
		Если НЕ рХКМ.Успешно Тогда
			МаркировкаКС.ДобавитьОшибки(Результат, рХКМ);					
		КонецЕсли; 
	Иначе
		МаркировкаКС.ДобавитьОшибки(Результат, рАгрегации);		
	КонецЕсли; 
	
	Результат.Успешно = (Результат.Ошибки.Количество() = 0);
	
	Возврат Результат;
КонецФункции //ЗавершитьМаркировку_НаСервере()

&НаКлиенте
Процедура ЗаполнитьКомплектующие(Команда)
	ЗаполнитьКомплектующие_НаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКомплектующие_НаСервере()
	тПродукция = Объект.Товары.Выгрузить();
	
	Объект.Комплектующие.Очистить();
	Объект.Комплектующие.Загрузить(Документы.ЗаданиеНаСборкуКомплектовЧЗ.ПолучитьНеобходимыеКомплектующие(тПродукция));	
КонецПроцедуры

&НаКлиенте
Процедура Товары_Номенклатура_ПриИзменении(Элемент)
	ТекДанные = Элементы.Продукция.ТекущиеДанные;
	
	Если ТекДанные<>Неопределено Тогда
		Если ЗначениеЗаполнено(ТекДанные.Номенклатура) Тогда
			рНоменклатуры = ПолучитьРеквизитыШапки(ТекДанные.Номенклатура, "ОсновнаяЕдиница,ОсновнаяЕдиница.Коэффициент");					
			ТекДанные.Единица 		= рНоменклатуры.ОсновнаяЕдиница;
			ТекДанные.Коэффициент 	= рНоменклатуры.ОсновнаяЕдиница_Коэффициент;
		Иначе
			ТекДанные.Единица 		= Неопределено;
			ТекДанные.Коэффициент 	= 1;			
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьКоличествоСобраных(Команда)
	ОбновитьКоличествоСобраных_НаСервере();	
КонецПроцедуры

&НаСервере
Процедура ОбновитьКоличествоСобраных_НаСервере()
	рСборки = ПолучитьКоличествоСобраных();
	Для Каждого СтрокаТЧ Из Объект.Товары Цикл
		СтрокаТЧ.СобраноКомплектов = рСборки[СтрокаТЧ.Номенклатура];			
		
		Если СтрокаТЧ.СобраноКомплектов > СтрокаТЧ.Количество Тогда
			СтрокаТЧ.ИндексКартинки = 0; //+			
		ИначеЕсли СтрокаТЧ.СобраноКомплектов < СтрокаТЧ.Количество Тогда
			СтрокаТЧ.ИндексКартинки = 2; //-
		Иначе
			СтрокаТЧ.ИндексКартинки = -1;		
		КонецЕсли;
	КонецЦикла;
	
	Элементы.ТоварыСобраноКомплектов.ТекстПодвала = Формат(Объект.Товары.Итог("СобраноКомплектов"), "ЧРГ=' '; ЧГ=3,0");
КонецПроцедуры //ОбновитьКоличествоСобраных_НаСервере()

&НаСервере
Функция ПолучитьКоличествоСобраных()
	Запрос = Новый Запрос;
	Запрос.Текст = "	
	|ВЫБРАТЬ
	|	ШтрихкодКомплекта.Владелец КАК Продукция,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ШтрихкодКомплекта) КАК СобраноШК
	|ИЗ
	|	Документ.ЛистСборкиКомплектовЧЗ.ШтрихкодыУпаковок
	|ГДЕ
	|	Ссылка.ДокОснование = &ДокОснование
	|	//И Ссылка.Завершен
	|	И Ссылка.Проведен
	|	И НЕ ШтрихкодКомплекта.ВерсияДанных ЕСТЬ NULL			
	|СГРУППИРОВАТЬ ПО
	|	ШтрихкодКомплекта.Владелец
	|";
	
	Запрос.УстановитьПараметр("ДокОснование", Объект.Ссылка);
	
	Результат = Новый Соответствие;
	
	Выборка	= Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат[Выборка.Продукция] = Выборка.СобраноШК;	
	КонецЦикла;
	
	Возврат Результат;
КонецФункции //ПолучитьКоличествоСобраных_НаСервере()

&НаКлиенте
Процедура Товары_Количество_ПриИзменении(Элемент)
	ОбновитьКоличествоСобраных_НаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОбовитьКоличествоСобраных(Команда)
	ОбновитьКоличествоСобраных_НаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СоздатьЛистСборки(Команда)
	
	Ошибки = "";
	ТекущиеДанные = Элементы.Продукция.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда                         
		Ошибки = "Не выбрана строка комплекта !";
	ИначеЕсли НЕ ЗначениеЗаполнено(ТекущиеДанные.Номенклатура) Тогда
		Ошибки = "В выбраной строке не заполнен комплект !";
	КонецЕсли;
	Если НЕ ПустаяСтрока(Ошибки) Тогда
		ПоказатьПредупреждение(, Ошибки);
		Возврат;	
	КонецЕсли;	
	
	Если Объект.Ссылка.Пустая() ИЛИ НЕ Объект.Проведен  Тогда
		Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение));	
	КонецЕсли;
	
	// Кельманов А.В. - HELP-4221 - 2025.07.17 {
	//пФормыЛСК = Новый Структура("Основание", Новый Структура("ДокОснование,Продукция,фРежим", Объект.Ссылка, ТекущиеДанные.Номенклатура, 2));
	Если ЭтоСкладМаркированногоТовара Тогда
		пФормыЛСК = Новый Структура("Основание", Новый Структура("ДокОснование,Продукция,фРежим", Объект.Ссылка, Неопределено, 0));
	Иначе
		пФормыЛСК = Новый Структура("Основание", Новый Структура("ДокОснование,Продукция,фРежим", Объект.Ссылка, ТекущиеДанные.Номенклатура, 2));
	КонецЕсли;
	// Кельманов А.В. - HELP-4221 - 2025.07.17 }
	
	ОткрытьФорму("Документ.ЛистСборкиКомплектовЧЗ.ФормаОбъекта", пФормыЛСК);
	
КонецПроцедуры

// Кухарь А.Ю.  21.03.2025 начало
// Пустая задача
 &НаСервере
Процедура ЗавершитьСборкуПринудительноНаСервере()
	если не РольДоступна("Администратор") тогда
		Возврат;	
	КонецЕсли;

	Документы.ЗаданиеНаСборкуКомплектовЧЗ.ЗавершитьЗадание(Объект.Ссылка);
КонецПроцедуры

// Кухарь А.Ю.  21.03.2025 конец

&НаСервереБезКонтекста
Функция ЗарезервироватьКМ_НаСервере(ДокСсылка)
	Возврат Документы.ЗаданиеНаСборкуКомплектовЧЗ.ЗарезервироватьКМ(ДокСсылка);
КонецФункции

&НаКлиенте
Процедура ЗабронироватьКМ(Команда)
	Если НЕ МаркировкаК.ЗаписатьИзмененныйОбъектВУпрФорме(ЭтаФорма) Тогда Возврат КонецЕсли; 
	
	рБронирования = ЗарезервироватьКМ_НаСервере(Объект.Ссылка);
КонецПроцедуры
// Кухарь А.Ю.  21.03.2025 конец

// Кельманов А.В. - HELP-5168 - 2025.06.03
&НаСервере
Функция ЗаполнитьКодыЧЗ()
	
	Ошибки = "";
	
	ДокОбъект = РеквизитФормыВЗначение("Объект");
	
	СтруктураОтвета = Документы.ЗаданиеНаСборкуКомплектовЧЗ.ЗаполнитьКодыЧЗВЗСБ(ДокОбъект, Объект.ДокОснование);
	
	Если Не СтруктураОтвета.Успех Тогда
		
		Ошибки = СтруктураОтвета.Ошибки;
		
	КонецЕсли;
	
	Возврат Ошибки;
			
КонецФункции

// Кельманов А.В. - для чистки зависших документов ЛСК при сборке спаек на ТСД - 2025.03.26
&НаСервере
// Кельманов А.В. - ИЗМ-0000000141 - 2026.06.24 {
//Процедура УдалитьИзЛСКСтрокиСПустымиКодамиКомплектующихНаСервере()
Процедура УдалитьИзЛСКСтрокиСПустымиКодамиКомплектующихНаСервере(ВыбранныйЛСК = Неопределено, ВыбраннаяСпайка = Неопределено, ТекстСообщения = "")
// Кельманов А.В. - ИЗМ-0000000141 - 2026.06.24 }

	Запрос = Новый Запрос;
	
	// Кельманов А.В. - ИЗМ-0000000141 - 2026.06.24 {
	//Запрос.Текст = "ВЫБРАТЬ
	//               |	ЛистСборкиКомплектовЧЗШтрихкодыУпаковок.Ссылка КАК ЛСК
	//               |ИЗ
	//               |	Документ.ЛистСборкиКомплектовЧЗ.ШтрихкодыУпаковок КАК ЛистСборкиКомплектовЧЗШтрихкодыУпаковок
	//               |ГДЕ
	//               |	ЛистСборкиКомплектовЧЗШтрихкодыУпаковок.ШтрихкодУпаковки = ЗНАЧЕНИЕ(Справочник.ШтрихкодыУпаковокТоваров.ПустаяСсылка)
	//               |	И ЛистСборкиКомплектовЧЗШтрихкодыУпаковок.Ссылка.ДокОснование = &ЗСБ
	//               |
	//               |СГРУППИРОВАТЬ ПО
	//               |	ЛистСборкиКомплектовЧЗШтрихкодыУпаковок.Ссылка";
	//
	//Запрос.УстановитьПараметр("ЗСБ", Объект.Ссылка);

	//Выборка = Запрос.Выполнить().Выбрать();
	//
	//Пока Выборка.Следующий() Цикл
	//	
	//	ЛСКОбъект = Выборка.ЛСК.ПолучитьОбъект();
	//	
	//	ПараметрыПоиска = Новый Структура("ШтрихкодУпаковки", Справочники.ШтрихкодыУпаковокТоваров.ПустаяСсылка());
	//	
	//	МассивСтрокДляУдаления = ЛСКОбъект.ШтрихкодыУпаковок.НайтиСтроки(ПараметрыПоиска);
	//	
	//	Для Каждого Строка Из МассивСтрокДляУдаления Цикл
	//		
	//		ЛСКОбъект.ШтрихкодыУпаковок.Удалить(Строка);
	//		
	//	КонецЦикла;
	//	
	//	ТекстСообщения = "";
	//	
	//	Попытка
	//		
	//		ЛСКОбъект.Записать(РежимЗаписиДокумента.Проведение);
	//					
	//		ТекстСообщения = "В ЛСК " + ЛСКОбъект.Номер + " строки с пустыми кодами комплектующих удалены!";
	//		
	//	Исключение
	//		
	//		ТекстСообщения = ОписаниеОшибки();
	//		
	//	КонецПопытки;
	//	
	//	Сообщить(ТекстСообщения);
	//	
	//КонецЦикла;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛистСборкиКомплектовЧЗШтрихкодыУпаковок.Ссылка КАК ЛСК,
	               |	ЛистСборкиКомплектовЧЗШтрихкодыУпаковок.ШтрихкодКомплекта КАК ШтрихкодКомплекта
	               |ИЗ
	               |	Документ.ЛистСборкиКомплектовЧЗ.ШтрихкодыУпаковок КАК ЛистСборкиКомплектовЧЗШтрихкодыУпаковок
	               |ГДЕ
	               |	ЛистСборкиКомплектовЧЗШтрихкодыУпаковок.ШтрихкодУпаковки = ЗНАЧЕНИЕ(Справочник.ШтрихкодыУпаковокТоваров.ПустаяСсылка)
	               |	И ЛистСборкиКомплектовЧЗШтрихкодыУпаковок.Ссылка.ДокОснование = &ЗСБ
	               |	И ЛистСборкиКомплектовЧЗШтрихкодыУпаковок.Ссылка = &ВыбранныйЛСК
	               |	И ЛистСборкиКомплектовЧЗШтрихкодыУпаковок.ШтрихкодКомплекта.Владелец = &ВыбраннаяСпайка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЛистСборкиКомплектовЧЗШтрихкодыУпаковок.Ссылка,
	               |	ЛистСборкиКомплектовЧЗШтрихкодыУпаковок.ШтрихкодКомплекта
	               |ИТОГИ ПО
	               |	ЛСК";
	
	Запрос.УстановитьПараметр("ЗСБ", Объект.Ссылка);
	
	Если ЗначениеЗаполнено(ВыбранныйЛСК) Тогда
		
		Запрос.УстановитьПараметр("ВыбранныйЛСК", ВыбранныйЛСК);
	
	Иначе
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ЛистСборкиКомплектовЧЗШтрихкодыУпаковок.Ссылка = &ВыбранныйЛСК", "");
		
	КонецЕсли;

	Если ЗначениеЗаполнено(ВыбраннаяСпайка) Тогда
		
		Запрос.УстановитьПараметр("ВыбраннаяСпайка", ВыбраннаяСпайка);
	
	Иначе
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ЛистСборкиКомплектовЧЗШтрихкодыУпаковок.ШтрихкодКомплекта.Владелец = &ВыбраннаяСпайка", "");
		
	КонецЕсли;

	ВыборкаЛСК = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	МассивТекстов = Новый Массив;
	
	Пока ВыборкаЛСК.Следующий() Цикл
		
		ЛСКОбъект = ВыборкаЛСК.ЛСК.ПолучитьОбъект();
		
		Если ЗначениеЗаполнено(ВыбраннаяСпайка) Тогда
			
			Выборка = ВыборкаЛСК.Выбрать();
			
			Пока Выборка.Следующий() Цикл
				
				ПараметрыПоиска = Новый Структура("ШтрихкодУпаковки, ШтрихкодКомплекта", Справочники.ШтрихкодыУпаковокТоваров.ПустаяСсылка(), Выборка.ШтрихкодКомплекта);
				
				МассивСтрокДляУдаления = ЛСКОбъект.ШтрихкодыУпаковок.НайтиСтроки(ПараметрыПоиска);
				
				Для Каждого Строка Из МассивСтрокДляУдаления Цикл
					
					ЛСКОбъект.ШтрихкодыУпаковок.Удалить(Строка);
					
				КонецЦикла;
				
			КонецЦикла;
			
		Иначе
			
			ПараметрыПоиска = Новый Структура("ШтрихкодУпаковки", Справочники.ШтрихкодыУпаковокТоваров.ПустаяСсылка());
			
			МассивСтрокДляУдаления = ЛСКОбъект.ШтрихкодыУпаковок.НайтиСтроки(ПараметрыПоиска);
			
			Для Каждого Строка Из МассивСтрокДляУдаления Цикл
				
				ЛСКОбъект.ШтрихкодыУпаковок.Удалить(Строка);
				
			КонецЦикла;
			
		КонецЕсли;
		
		Попытка
			
			ЛСКОбъект.Записать(РежимЗаписиДокумента.Проведение);
						
			Если ЗначениеЗаполнено(ВыбраннаяСпайка) Тогда
				
				МассивТекстов.Добавить("В ЛСК " + ЛСКОбъект.Номер + " для продукции " + ВыбраннаяСпайка + " строки с пустыми кодами комплектующих удалены!");
				
			Иначе
				
				МассивТекстов.Добавить("В ЛСК " + ЛСКОбъект.Номер + " строки с пустыми кодами комплектующих удалены!");
				
			КонецЕсли;
			
		Исключение
			
			МассивТекстов.Добавить("Не удалось записать ЛСК " + ЛСКОбъект.Номер + ": " + ОписаниеОшибки());
			
		КонецПопытки;
		
	КонецЦикла;
	
	Если МассивТекстов.Количество() > 0 Тогда
		
		ТекстСообщения = СтрСоединить(МассивТекстов, Символы.ПС);
		
	КонецЕсли;
	// Кельманов А.В. - ИЗМ-0000000141 - 2026.06.24 }
	
КонецПроцедуры

#Область ОбработчикиКомандФормы

// Кельманов А.В. - для чистки зависших документов ЛСК при сборке спаек на ТСД - 2025.03.26
&НаКлиенте
Процедура УдалитьИзЛСКСтрокиСПустымиКодамиКомплектующих(Команда)

	// Кельманов А.В. - ИЗМ-0000000141 - 2026.06.24 {
	//УдалитьИзЛСКСтрокиСПустымиКодамиКомплектующихНаСервере();
	ТекстСообщения = "";
	
	УдалитьИзЛСКСтрокиСПустымиКодамиКомплектующихНаСервере(, , ТекстСообщения);
	
	Если ЗначениеЗаполнено(ТекстСообщения) Тогда
		
		Сообщить(ТекстСообщения);
		
	КонецЕсли;	
	// Кельманов А.В. - ИЗМ-0000000141 - 2026.06.24 }
	
КонецПроцедуры

// Кельманов А.В. - ИЗМ-0000000141 - 2026.06.24
&НаКлиенте
Процедура УдалитьИзЛСКСтрокиСПустымиКодамиКомплектующих_ВыбранныйЛСК(Команда)

	ВыбранныйЛСК = Элементы.СписокЛСК.ТекущаяСтрока;
	
	Если ЗначениеЗаполнено(ВыбранныйЛСК) Тогда
		
		ТекстСообщения = "";
		
		УдалитьИзЛСКСтрокиСПустымиКодамиКомплектующихНаСервере(ВыбранныйЛСК, , ТекстСообщения);
		
		Если ЗначениеЗаполнено(ТекстСообщения) Тогда
			
			Сообщить(ТекстСообщения);
			
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

// Кельманов А.В. - ИЗМ-0000000141 - 2026.06.24
&НаКлиенте
Процедура УдалитьИзЛСКСтрокиСПустымиКодамиКомплектующих_ВыбраннаяСпайка(Команда)

	ПродукцияТекДанные = Элементы.Продукция.ТекущиеДанные;
	
	Если ПродукцияТекДанные <> Неопределено Тогда
		
		ВыбраннаяСпайка = ПродукцияТекДанные.Номенклатура;
		
		Если ЗначениеЗаполнено(ВыбраннаяСпайка) Тогда
			
			ТекстСообщения = "";
			
			УдалитьИзЛСКСтрокиСПустымиКодамиКомплектующихНаСервере(, ВыбраннаяСпайка, ТекстСообщения);
			
			Если ЗначениеЗаполнено(ТекстСообщения) Тогда
				
				Сообщить(ТекстСообщения);
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
